# Insertion Sort การจัดเรียงข้อมูลแบบแทรก 

def insertion_sort(vals):
    for i in range(1, len(vals)):               # วนค่าสมาชิกใน vals
        key = vals[i]                           # กำหนด key มีค่าเท่ากับสมาชิกของ vals ในตำแหน่งที่ i
        j = i - 1                               # กำหนด j มีค่าเท่ากับตำแหน่งของสมาชิกของ vals ที่ i - 1 หรือ ตำแหน่งก่อนหน้า i หนึ่งตำแหน่ง

        while j >= 0 and vals[j] > key:         # วนลูปเมื่อ j มีค่ามากกว่าหรือเท่ากับ 0 และ ค่าของสมาชิกของ vals ตำแหน่งที่ j มากกว่า key
            vals[j + 1] = vals[j]               # กำหนดค่าให้สมาชิกของ vals ในตำแหน่งที่ j + 1 (สมาชิกหลังจากตำแหน่ง j หนึ่งตำแหน่ง) มีค่าเท่ากับ สมาชิกในตำแหน่งที่ j
            j -= 1                              # กำหนดให้ j - 1 ทุกรอบของการวนลูป

        vals[j + 1] = key                       # กำหนดให้สมาชิกของ vals ตำแหน่งที่ j + 1 มีค่าเท่ากับ key
    return vals


if __name__ == "__main__":
    vals = [5, 2, 4, 1, 6, 3]
    print(insertion_sort(vals))